<?php
// +----------------------------------------------------------------------
// | ThinkCMF [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | Copyright (c) 2015-2022 http://www.sandbean.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: afei <feoyo@qq.com>
// +----------------------------------------------------------------------
return [
    'TABLE_JOB_CATEGORY'  => '岗位分类',
    'TABLE_JOB_POST'      => '岗位',
    'TABLE_SLIDE'      => '幻灯片',
    'TABLE_JOB_POST#PAGE' => '页面'
];